course_rooms = {
    "101": "12",
    "102": "15",
    "103": "7",
    "104": "20",
    "105": "16",
    "106": "2",
    "107": "5",
    "108": "18",
    "109": "13",
    "110": "9",
}

course_times = {
    "101": "10:15 - 11:50",
    "102": "12:00 - 13:35",
    "103": "14:15 - 15:50",
    "104": "16:00 - 17:35",
    "105": "17:45 - 19:20",
    "106": "10:15 - 11:50",
    "107": "12:00 - 13:35",
    "108": "14:15 - 15:50",
    "109": "16:00 - 17:35",
    "110": "17:45 - 19:20",
}

while True:
    course_number = input("Введите номер курса (или 0 для выхода): ")
    
    if course_number == "0":
        break
    
    if course_number in course_rooms:
        room = course_rooms[course_number]
        time = course_times[course_number]
        print("Курс:", course_number)
        print("Аудитория:", room)
        print("Время проведения:", time)
    else:
        print("Курс с таким номером не найден. Попробуйте снова.")